# YCoordinate

## Description
Returns the Y coordinate of the object relative to the user origin.

```pascal
FUNCTION YCoordinate(c : CRITERIA): REAL;
```

```python
def vs.YCoordinate(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|The search criteria string.|

## Remarks
Valid objects are PIOs, Symbols and Loci.

## Version
Availability: from Vectorworks 2011

## Category
* Criteria